[
  {
    "commentBody": "weird pull but I really like shiver for this, it doesn't heavily focus on spell casting but they use a genesis system that has a weird sybol on the die. Everytime you roll weird it moves up this thing that makes the situation more dangerous called the doomsday clock. all magic relies on weird so your relying on something that makes rthings worse to get more powerful",
    "commentWriter": "Wellby High-hill"
  },
  {
    "commentBody": "i've heard of this system called Altered that utlises point buy as the system for leveling but it also gets used to cast magic, regain some luck craft things etc so you have to be really crative with your resources managing how much you level with how important it is to use your powers in game",
    "commentWriter": "Silaqui Nailo"
  },
  {
    "commentBody": "you coud try, life two: return of the existential crisis, as a title",
    "commentWriter": "Dami The Destroyer"
  },
  {
    "commentBody": "hmmm... how about: nope, the story of my afterlife",
    "commentWriter": "Criella"
  },
  {
    "commentBody": "I don't know Griblek fun is fun man regardless of the game. If you don't like how your GM,DM etc. plays maybe start your own game",
    "commentWriter": "Drea Picard"
  },
  {
    "commentBody": "ahahahahahahahahahahahahahahahahahahahahahahahahaha shirts wack, couch is wack, outfits wack but you know I feel like this was pretty insightful if your mom wrote it",
    "commentWriter": "Spark"
  },
  {
    "commentBody": "ok..ok!! 1.Call of Cthulhu, 2.Monster of the Week, 3.Fiasco, 4.Shiver, 5.Cthulhu Dark Honestly D100 systems in general rock my sox off!! super new player friendly",
    "commentWriter": "Drea Picard"
  },
  {
    "commentBody": "1.goblins, 2.an army of goblins, 3.an extroidinary quest for the amulent of goblin kind, 4.a trip into an outside dimension where goblins are the only race, 5.have you tried goblin deez nuts?",
    "commentWriter": "Spark"
  },
  {
    "commentBody": "if you want simple the cthulhu hack is great very simple stats on a d6 system that pushes for heavy rp and combat is super simple",
    "commentWriter": "Karnyl Coldmask"
  },
  {
    "commentBody": "I love my mother and your prior comments have been forwarded to her inbox she is now coming downstairs to tell me to stop emailing her",
    "commentWriter": "Grilbek Munkirr"
  }
]