[
  {
    "title": "Looking for a system where the probability of casting your next spell decreases as a function of the number of spells already cast.",
    "subject": "suggestions",
    "body": "I'm familiar with DCC and PbtA games, but I'm curious if there is a rpg system where magic isn't slotted, but instead the probability of casting another spell decreases with each successful cast, and casting subsequent magic is harder regardless of spell level/power (although higher penalties for casting higher magic would be alright). Ideally it would be a system where if you fail on casting a spell, the probability of success on your subsequent casts isn't affected, but each successful cast does have an effect. If you have played this sort of system I'm also really curious on your opinion of the mechanics, and how it affected your play as a magic caster. I feel like this would make magic wielders more cautious, but what was your experience?",
    "user": "Hermadite The Traveler"
  },
  {
    "title": "Help Name My Next Campaign",
    "subject": "request",
    "body": "My current campaign is finishing soon, and I've got big plans for the next one. It's going to be set in 1978, Massachusetts and is going to have a pretty serious tone. I'll be using Monster of the Week and taking inspiration from a few Lovecraft stories. The player characters are all people who have died in the past (a librarian of alexandria, a 14-th century nun, a cowboy, a centurion, someone who died like a week ago, etc.) who have been brought back to bring about the coming of an old god, or some other being like that. I'd like to do a short title and then an or ... thing. I don't have the first part, but I've been thinking over [Brief Title], or Life In Its Unending Brevity. Again, that's a working title, so I'm open to suggestions.",
    "username": "Drea Picard"
  },
  {
    "title": "A bit of a rant on telling people they can ignore the rules ",
    "subject": "discussion",
    "body": "Yes, I can ignore the rules. I can also colour outside the lines and have walked up the down escalators and down the up escalators. And if they're empty, sometimes I still do. Telling myself or almost anyone of any age that we don't have to follow the rules of make-believe in the book about playing pretend can be condescending. A few people are too rigid about the rules Or are too lax about the rules Or are too rigid about any snack with crumbs or grease. Can we chalk this up to group expectations? I prefer games that play primarily by the rules. And really, that's all there is to it.",
    "username": "Grilbek Munkirr"
  },
  {
    "title": "What are your favorite TTRPGs?",
    "subject": "general",
    "body": "Give me a short list and maybe a couple of sentences why about your favorite TTRPGS! Top 5 at most and maybe you want to gush about your absolute favorite. Keep it elegant and no hate comments (I will block them)!",
    "username": "Karnyl Coldmask"
  },
  {
    "title": "Help me choose a new game",
    "subject": "suggestions",
    "body": "So far I've basically only played D&D 5E and I'm looking to branch out a bit. I'm looking to expand a bit and get into something that has a bit more horror flavor and maybe more combat/action than RP.So far I'm looking at Heart the City Beneath, Mork Borg, and Call of Cthulu. Any recommendations on what to go with between these games, or other systems that might fit what I'm looking for? Most the people I play with don't game too much so simpler is better. Thanks!",
    "username": "Spark"
  }
]
